{
  "home": {
    "title": "Geometría en Movimiento",
    "intro": "Bienvenido al simulador interactivo de Geometría Diferencial, donde las matemáticas toman forma y se mueven en el espacio tridimensional.",
    "description1": "Este entorno virtual fue creado para ofrecer una nueva forma de visualizar curvas y superficies complejas. Aquí puedes explorar estructuras geométricas que normalmente solo existen en el papel o en la imaginación, transformándolas en experiencias visuales inmersivas.",
    "description2": "Nuestra propuesta es conectar teoría y visualización. Curvas paramétricas, superficies suaves, torsión, curvatura... todo esto a tu alcance en una interfaz simple y sin distracciones.",
    "quote": "“Las matemáticas no son solo números; son un lenguaje para describir el espacio y la belleza que habita en él.”"
  },
  "header": {
    "home": "Inicio",
    "viewer": "Visualizador",
    "about": "Acerca de"
  },
  "about": {
    "title": "Acerca del Simulador",
    "intro": "Este simulador fue creado para ofrecer una experiencia interactiva en el estudio de la Geometría Diferencial.",
    "description": "Su objetivo es proporcionar una herramienta educativa que haga que el aprendizaje de curvas y superficies sea más accesible, visual e intuitivo. A través de la exploración 3D, es posible observar propiedades geométricas de forma dinámica.",
    "tech": "El proyecto combina tecnologías modernas como React, Three.js y TailwindCSS, integrando la visualización computacional con las matemáticas avanzadas en una interfaz minimalista.",
    "author": "Desarrollado por"
  },
  "footer": {
    "developed": "Desarrollado por",
    "rights": "Todos los derechos reservados."
  },
  "viewer": {
    "title": "Visor de Geometría Diferencial",
    "subtitle": "Explora superficies clásicas y curvas diferenciables con precisión y estilo.",
    "generate": "Generar",
    "loading": "Cargando...",
    "generating": "Generando geometría diferencial..."
  },
  "curves": {
    "sphere": "Esfera",
    "torus": "Toro",
    "enneper": "Enneper",
    "helicoid": "Helicoide",
    "hyperbolic_paraboloid": "Paraboloide Hiperbólico",
    "elliptic_paraboloid": "Paraboloide Elíptico"
  },
  "curvatures": {
    "gaussian": "Gaussiana",
    "mean": "Media",
    "principal": "Principales",
    "normal": "Normal (dirección 1,1)"
  }
}
